import CustomSecondBanner from "../../components/shared/CustomSecondBanner";

const Poriciti = () => {
  // Define `secondBannerData` here or fetch it from an API
  const secondBannerData = {
    title: "পরিচিতি",
    description: "Some description here",
    // Add other properties if needed
  };

  const bannerHeight = "h-48";

  return (
    <div className="font-bengali ">
      <CustomSecondBanner
        secondBannerData={secondBannerData}
        bannerHeight={bannerHeight}
      />
      <div className="container mx-auto p-6 mt-10">
        <div className="grid grid-cols-1 md:grid-cols-3">
          <div className="col-span-2">
            <h2 className="text-xl mb-4 font-bold text-[#FF6600]">
              মাসিক আলকাউসার
            </h2>
            <p className="text-xl">
              মাসিক আলকাউসার ২০০৫ সাল থেকে নিয়মিত প্রকাশিত হয়ে আসা একটি
              নির্ভরযোগ্য ইসলামী সাময়িকী। এটি গবেষণামূলক উচ্চতর ইসলামী শিক্ষা ও
              দাওয়াহ প্রতিষ্ঠান মারকাযুদ দাওয়াহ আলইসলামিয়া ঢাকা-এর মুখপত্র। এতে
              থাকে ওলামা, তলাবা ও দ্বীনদার শ্রেণিসহ সংশ্লিষ্টদের জন্য
              গবেষণাধর্মী প্রবন্ধ-নিবন্ধ। এছাড়াও থাকে সর্বস্তরের মুসলমানদের জন্য
              বিভিন্ন বিষয়ের প্রয়োজনীয় লেখা ও দলিলভিত্তিক প্রশ্নোত্তর বিভাগ।
              <br /> <br />
              আলহামদুলিল্লাহ, অতি অল্প সময়ের মধ্যেই মাসিক আলকাউসার ওলামায়ে
              কেরাম, শিক্ষিত সমাজ ও সুধীজনদের আস্থা অর্জন করেছে। আর এর প্রকাশ
              সংখ্যাও উত্তরোত্তর বৃদ্ধি পাচ্ছে। আল্লাহ সুবহানাহু ওয়া তাআলা এ
              ধারা অব্যাহত রাখুন। আমীন।
              <br /> <br />
            </p>
            <h2 className="text-blue-950 font-bold text-xl">সম্পাদনা পরিষদ</h2>
            <br />
            <br />
            <div className="space-y-2 text-xl">
              <div className="flex justify-start">
                <span className="font-bold w-52">
                  প্রতিষ্ঠাকালীন উপদেষ্টা :
                </span>
                <span className="font-normal">
                  হযরত মাওলানা আবদুল হাই পাহাড়পুরী রাহ.
                </span>
              </div>
              <div className="flex justify-start">
                <span className="font-bold w-52">তত্ত্বাবধায়ক :</span>
                <span className="font-normal">
                  মাওলানা মুহাম্মাদ আবদুল মালেক
                </span>
              </div>
              <div className="flex justify-start">
                <span className="font-bold w-52">সম্পাদক ও প্রকাশক :</span>
                <span className="font-normal">
                  আবুল হাসান মুহাম্মাদ আবদুল্লাহ
                </span>
              </div>
              <div className="flex justify-start">
                <span className="font-bold w-52">সহ-সম্পাদক :</span>
                <span className="font-normal">
                  মাওলানা মুহাম্মাদ যাকারিয়া আবদুল্লাহ
                </span>
              </div>
            </div>
            <br />
            <br />
            <div className="text-xl">
              মাসিক আলকাউসার-এর মূল প্রতিষ্ঠান মারকাযুদ দাওয়াহ আলইসলামিয়া ঢাকা।
              নিম্নে মারকাযুদ দাওয়াহ আলইসলামিয়া ঢাকা-এর সংক্ষিপ্ত পরিচিতি উল্লেখ
              করা হল।
              <br />
              <br />
            </div>
            <div>
              <h2 className="text-xl text-[#FF6600] font-bold">
                মারকাযুদ দাওয়াহ আলইসলামিয়া ঢাকা
              </h2>
              <br />
              <br />
              <p className="text-xl">
                তালীম, তাসনীফ, দাওয়াহ-এই তিনটি মৌলিক বিষয়কে সামনে নিয়ে ১৪১৬
                হিজরী, মোতাবেক ১৯৯৬ ঈসায়ী সালে শুরু হয় এর পথচলা। সময়ের প্রয়োজন
                বিবেচনা করে কুরআন-সুন্নাহ ও দ্বীনী ইলম চর্চায় নতুন গতির সঞ্চার ও
                দ্বীনী শিক্ষার্থীদের মাঝে বহুমুখী যোগ্যতা তৈরি এর প্রধান লক্ষ্য।
                এখানে আরববিশ্ব ও বিদেশের অন্যান্য উচ্চ শিক্ষাপ্রতিষ্ঠানের মতো
                মাদরাসাসমূহ থেকে শিক্ষা সমাপণকারী মেধাবী আলেমদেরকে ২ থেকে ৫ বছর
                মেয়াদে হাদীস, ফিকহ ও ইসলামী জ্ঞান-শাস্ত্রের বিভিন্ন বিষয়ে
                গবেষণামূলক ও উচ্চতর প্রশিক্ষণ প্রদান করা হয়ে থাকে। সেই সাথে
                সাহাবায়ে কেরাম, তাবেয়ীন, আইম্মায়ে দ্বীন তথা আহলুস সুন্নাহ
                ওয়াল-জামাআতের স্বীকৃত নীতি অনুযায়ী কুরআন-সুন্নাহর সহীহ-শুদ্ধ
                ব্যাখ্যা ও ইসলামের বাণী জনগণের নিকট পৌঁছে দেওয়া এবং দ্বীনের
                প্রচার-প্রসার ও দ্বীনী শিক্ষা বিস্তারের সকল চ্যালেঞ্জ ও
                প্রতিবন্ধকতাসমূহ মোকাবেলা করে সর্বস্তরের মানুষের মাঝে ধর্ম ও
                ধর্মীয় শিক্ষার অনুক‚লে ইতিবাচক মনোভাব তৈরির প্রয়াস মারকাযের
                কর্মসূচিতে বিশেষভাবে শামিল।
                <br />
                <br />
                সর্বশ্রেণীর মুসলমানদের উদ্দেশ্যে নিবেদিত বিভাগসমূহ :
              </p>
              <br />
              <br />
              <div className="flex flex-col">
                <p className="text-blue-950 text-xl font-bold">
                  দারুল ইফতা (ফতোয়া বিভাগ) :
                </p>
                <br />

                <p className="text-xl">
                  এখানে কুরআন-সুন্নাহ ও ফিকহ-ফতোয়ার কিতাবাদি থেকে নির্ভরযোগ্য
                  মুফতীগণ ইসলাম সংক্রান্ত যুগ-জিজ্ঞাসার জবাব দিয়ে থাকেন। লিখিত
                  ফতোয়ার পাশাপাশি দারুল ইফতায় এসে মৌখিকভাবে মাসআলা জানা যায়।
                  এছাড়াও নির্দিষ্ট নম্বরে ফোন করে ও ই-মেইলের মাধ্যমে মাসআলা
                  জানার সুযোগ রয়েছে।
                </p>
              </div>
              <br /> <br />
              <div className="flex flex-col">
                <p className="text-blue-950 text-xl font-bold">
                  দারুল ইফতা (ফতোয়া বিভাগ) :
                </p>
                <br />

                <p className="text-xl">
                  এখানে কুরআন-সুন্নাহ ও ফিকহ-ফতোয়ার কিতাবাদি থেকে নির্ভরযোগ্য
                  মুফতীগণ ইসলাম সংক্রান্ত যুগ-জিজ্ঞাসার জবাব দিয়ে থাকেন। লিখিত
                  ফতোয়ার পাশাপাশি দারুল ইফতায় এসে মৌখিকভাবে মাসআলা জানা যায়।
                  এছাড়াও নির্দিষ্ট নম্বরে ফোন করে ও ই-মেইলের মাধ্যমে মাসআলা
                  জানার সুযোগ রয়েছে।
                </p>
              </div>
              <br /> <br />
              <div className="flex flex-col">
                <p className="text-blue-950 text-xl font-bold">
                  দারুল ইফতা (ফতোয়া বিভাগ) :
                </p>
                <br />

                <p className="text-xl">
                  এখানে কুরআন-সুন্নাহ ও ফিকহ-ফতোয়ার কিতাবাদি থেকে নির্ভরযোগ্য
                  মুফতীগণ ইসলাম সংক্রান্ত যুগ-জিজ্ঞাসার জবাব দিয়ে থাকেন। লিখিত
                  ফতোয়ার পাশাপাশি দারুল ইফতায় এসে মৌখিকভাবে মাসআলা জানা যায়।
                  এছাড়াও নির্দিষ্ট নম্বরে ফোন করে ও ই-মেইলের মাধ্যমে মাসআলা
                  জানার সুযোগ রয়েছে।
                </p>
              </div>
              <br /> <br />
              <div className="flex flex-col">
                <p className="text-blue-950 text-xl font-bold">
                  দারুল ইফতা (ফতোয়া বিভাগ) :
                </p>
                <br />

                <p className="text-xl">
                  এখানে কুরআন-সুন্নাহ ও ফিকহ-ফতোয়ার কিতাবাদি থেকে নির্ভরযোগ্য
                  মুফতীগণ ইসলাম সংক্রান্ত যুগ-জিজ্ঞাসার জবাব দিয়ে থাকেন। লিখিত
                  ফতোয়ার পাশাপাশি দারুল ইফতায় এসে মৌখিকভাবে মাসআলা জানা যায়।
                  এছাড়াও নির্দিষ্ট নম্বরে ফোন করে ও ই-মেইলের মাধ্যমে মাসআলা
                  জানার সুযোগ রয়েছে।
                </p>
              </div>
              <br /> <br />
              <div className="flex flex-col">
                <p className="text-blue-950 text-xl font-bold">
                  দারুল ইফতা (ফতোয়া বিভাগ) :
                </p>
                <br />

                <p className="text-xl">
                  এখানে কুরআন-সুন্নাহ ও ফিকহ-ফতোয়ার কিতাবাদি থেকে নির্ভরযোগ্য
                  মুফতীগণ ইসলাম সংক্রান্ত যুগ-জিজ্ঞাসার জবাব দিয়ে থাকেন। লিখিত
                  ফতোয়ার পাশাপাশি দারুল ইফতায় এসে মৌখিকভাবে মাসআলা জানা যায়।
                  এছাড়াও নির্দিষ্ট নম্বরে ফোন করে ও ই-মেইলের মাধ্যমে মাসআলা
                  জানার সুযোগ রয়েছে।
                </p>
              </div>
              <br /> <br />
              <div className="flex flex-col">
                <p className="text-blue-950 text-xl font-bold">
                  দারুল ইফতা (ফতোয়া বিভাগ) :
                </p>
                <br />

                <p className="text-xl">
                  এখানে কুরআন-সুন্নাহ ও ফিকহ-ফতোয়ার কিতাবাদি থেকে নির্ভরযোগ্য
                  মুফতীগণ ইসলাম সংক্রান্ত যুগ-জিজ্ঞাসার জবাব দিয়ে থাকেন। লিখিত
                  ফতোয়ার পাশাপাশি দারুল ইফতায় এসে মৌখিকভাবে মাসআলা জানা যায়।
                  এছাড়াও নির্দিষ্ট নম্বরে ফোন করে ও ই-মেইলের মাধ্যমে মাসআলা
                  জানার সুযোগ রয়েছে।
                </p>
              </div>
              <br /> <br />
              <div className="flex flex-col">
                <p className="text-blue-950 text-xl font-bold">
                  দারুল ইফতা (ফতোয়া বিভাগ) :
                </p>
                <br />

                <p className="text-xl">
                  এখানে কুরআন-সুন্নাহ ও ফিকহ-ফতোয়ার কিতাবাদি থেকে নির্ভরযোগ্য
                  মুফতীগণ ইসলাম সংক্রান্ত যুগ-জিজ্ঞাসার জবাব দিয়ে থাকেন। লিখিত
                  ফতোয়ার পাশাপাশি দারুল ইফতায় এসে মৌখিকভাবে মাসআলা জানা যায়।
                  এছাড়াও নির্দিষ্ট নম্বরে ফোন করে ও ই-মেইলের মাধ্যমে মাসআলা
                  জানার সুযোগ রয়েছে।
                </p>
              </div>
              <br /> <br />
              <div className="flex flex-col">
                <p className="text-blue-950 text-xl font-bold">
                  দারুল ইফতা (ফতোয়া বিভাগ) :
                </p>
                <br />

                <p className="text-xl">
                  এখানে কুরআন-সুন্নাহ ও ফিকহ-ফতোয়ার কিতাবাদি থেকে নির্ভরযোগ্য
                  মুফতীগণ ইসলাম সংক্রান্ত যুগ-জিজ্ঞাসার জবাব দিয়ে থাকেন। লিখিত
                  ফতোয়ার পাশাপাশি দারুল ইফতায় এসে মৌখিকভাবে মাসআলা জানা যায়।
                  এছাড়াও নির্দিষ্ট নম্বরে ফোন করে ও ই-মেইলের মাধ্যমে মাসআলা
                  জানার সুযোগ রয়েছে।
                </p>
              </div>
              <br /> <br />
              <p className="text-blue-950 text-xl font-bold">
                মারকাযের ব্যাংক হিসাব :
              </p>
              <br />
              <div className="space-y-4 text-xl font-bengali">
                {/* First Section */}
                <div className="flex flex-col space-y-2">
                  <div className="flex items-start">
                    <span className="mr-2">•</span>
                    <span>মারকাযুদ দাওয়াহ আলইসলামিয়া ঢাকা</span>
                  </div>
                  <br />
                  <div className="pl-6">
                    <p>চলতি হিসাব নং : ১৩৩২২০০০০০১৫২</p>
                    <br />
                    <p>আলআরাফাহ্‌ ইসলামী ব্যাংক লিমিটেড</p>
                    <br />
                    <p>পল্লবী শাখা, ঢাকা</p>
                    <br />
                  </div>
                </div>

                {/* Second Section */}
                <div className="flex flex-col space-y-3">
                  <div className="flex items-start">
                    <span className="mr-2">•</span>
                    <span>মারকাযুদ দাওয়াহ আলইসলামিয়া ঢাকা</span>
                  </div>
                  <br />
                  <div className="pl-6">
                    <p>চলতি হিসাব নং : ০১৮৮১৮০০২২১২৬</p>
                    <br />
                    <p>প্রাইম ব্যাংক লিমিটেড</p>
                    <br />
                    <p>প্রাইম ব্যাংক লিমিটেড</p>
                    <br />
                    <p> ইসলামী ব্যাংকিং শাখা (আইবিবি)</p>
                    <br />
                    <p> দিলকুশা, মতিঝিল, ঢাকা।</p>
                  </div>
                </div>
              </div>
            </div>
          </div>
          <div></div>
        </div>
      </div>
    </div>
  );
};

export default Poriciti;
