import React from "react";
import bannerImage from "../../assets/alkawsar-banner-230px.png"; // Adjust path if needed
import mosque from "../../assets/mosque.svg";
import adStart from "../../assets/adstarts.png";
import coverOne from "../../assets/cover-1.jpg";
import coverTwo from "../../assets/cover-2.jpg";
import coverThree from "../../assets/cover-3.jpg";
import coverFour from "../../assets/cover-4.jpg";
import coverFive from "../../assets/cover-5.jpg";
import coverSix from "../../assets/cover-6.png";
import { Link } from "react-router-dom";

const Reform = () => {
  const tags = [
    { name: "ঈমান-আকাইদ", path: "/akaid" },
    { name: "একটি ভুল নাম", path: "/akaid" },
    { name: "শিক্ষা/সিলেবাস", path: "/akaid" },
    { name: "আল-কুদস সংখ্যা", path: "/akaid" },
    { name: "নামাজ-সালাত", path: "/akaid" },
    { name: "তাহারাত", path: "/akaid" },
    { name: "রমযান প্রস্তাব", path: "/akaid" },
    { name: "হজ্জ", path: "/akaid" },
    { name: "যাকাত", path: "/akaid" },
    { name: "মুয়ামালাত-লেনদেন", path: "/akaid" },
    { name: "তাসাউফ-আধ্যাত্মিকতা", path: "/akaid" },
    { name: "ইসলামী অর্থনীতি", path: "/akaid" },
    { name: "দাওয়াত ও তাবলীগ", path: "/akaid" },
    { name: "শেয়ার ব্যবসা", path: "/akaid" },
    { name: "শবে বরাত", path: "/akaid" },
    { name: "শবে মিরাজ", path: "/akaid" },
    { name: "ঈদ", path: "/akaid" },
    { name: "নারী অধিকার", path: "/akaid" },
    { name: "বিদআত", path: "/akaid" },
    { name: "সীরাত", path: "/akaid" },
  ];

  const headings = [{ name: "প্রসঙ্গসমূহ »", path: "/buttons" }];
  const current = [{ name: "সাম্প্রতিক সংখ্যা »", path: "/more" }];
  return (
    <div className=" font-bengali ">
      <div
        className="relative  bg-cover bg-top h-60 flex items-center font-bengali "
        style={{
          backgroundImage: `url(${bannerImage})`,
        }}
      >
        <div className="absolute text-white text-center px-2 md:px-8 w-full">
          <div className="p-2 md:p-6">
            <div className="flex flex-col md:flex-row items-center md:space-y-0 justify-between md:space-x-4">
              {/* Left Section with text and border */}

              <div className="w-full md:w-[40%] md:text-left text-center font-bengali">
                <div className="flex items-center">
                  <h2 className="text-xl mt-24 md:text-3xl flex-grow text-white font-bold pb-[10px] border-b border-yellow-500">
                    বর্ষ: ২০,<span className="ml-4"></span> সংখ্যা: ১০
                  </h2>
                  {/* Mosque Icon */}
                  <img
                    src={mosque}
                    alt="mosque"
                    className="w-12 h-auto mt-24 -ml-[44px] hidden md:block"
                  />
                </div>
                {/* Subtitle Text */}
              </div>

              {/* Right Section with institution text */}
              <div className="w-[50%] font-bengali hidden md:block">
                <p className=" text-2xl mt-24 font-semibold text-right">
                  জুমাদাল উলা ১৪৪৬ || নভেম্বর ২০২৪
                </p>
              </div>
            </div>
          </div>
        </div>
      </div>

      <div>
        <div className="container mx-auto p-0 md:p-6 mt-5 ">
          <div className="grid grid-cols-1 md:grid-cols-3 gap-4">
            <div className="col-span-2 px-4 relative">
              <div className="absolute top-0 right-0 h-[890px] border-r-2 border-gray-200"></div>
              <Link to={"/anwarul-quran"}>
                <p className="px-3 py-2 bg-yellow-600 text-white inline-block">
                  সম্পাদকীয়
                </p>
              </Link>

              <p className="mt-6   text-3xl font-bold border-b-2 pb-3 border-gray-300">
                <span className="">বিশেষ সম্পাদকীয়</span>
              </p>
              <p className="font-bold py-4">সংস্কার ॥ </p>

              <p className="py-3 text-lg font-bold text-[#EC8F0A]">
                রাষ্ট্রসংস্কারের কাজ নবীজী সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের
                সীরাত থেকেই শুরু হোক
              </p>
              <p className="pt-4">
                <p className=" text-xl   leading-relaxed text-justify">
                  হযরত মাওলানা মুহাম্মাদ আবদুল মালেক ছাহেব দামাত বারাকাতুহুমকে
                  গত ২১-১০-২০২৪ তারিখে বায়তুল মোকাররম জাতীয় মসজিদের নতুন খতীব
                  হিসেবে নিয়োগ প্রদান করা হয়।
                </p>
                <br />

                <p className="text-xl   leading-relaxed text-justify">
                  হযরত মাওলানা মুহাম্মাদ আবদুল মালেক ছাহেব দামাত বারাকাতুহুমকে
                  গত ২১-১০-২০২৪ তারিখে বায়তুল মোকাররম জাতীয় মসজিদের নতুন খতীব
                  হিসেবে নিয়োগ প্রদান করা হয়।
                </p>
                <br />

                <div className="text-lg leading-relaxed text-justify">
                  ইতিমধ্যে ইসরাইল তার তথাকথিত বাহাদুরি দেখিয়েছে হামাস প্রধান বীর
                  মুজাহিদ ইয়াহইয়া সিনওয়ারকে হত্যার মাধ্যমে। আমেরিকার বয়োবৃদ্ধ
                  প্রেসিডেন্ট জো বাইডেন খুব খুশি প্রকাশ করেছেন যে, ইয়াহইয়া
                  সিনওয়ারকে হত্যার মাধ্যমে ওই অঞ্চলে শান্তি আসবে। এমন কথা
                  ইসরাইলও বলেছে। এবারই প্রথম না, এর আগেও ইসরাইল যখন বড় কোনো
                  মুজাহিদকে শহীদ করতে পেরেছে, তখনই দাবি করেছে, ওই অঞ্চলে শান্তি
                  চলে আসবে। কিন্তু যতই তারা এমন হিংস্র আচরণ করেছে, ততই তারা
                  অনিরাপদ হয়েছে। তাদের জনগণের নিরাপত্তাহীনতা বেড়েছে। কারণ
                  মুজাহিদরা দমে যায়নি। নতুন করে উজ্জীবিত হয়েছে। এবারও সে ভুল
                  কথাই প্রচার করা হচ্ছে। তারা খুশিতে লাফাচ্ছে।
                </div>
                <br />
                <div className="text-lg leading-relaxed text-justify">
                  রাষ্ট্র মেরামত ও সংস্কার নিয়ে যারা কাজ করবেন, আমরা একটি মৌলিক
                  বিষয়ের দিকে তাদের দৃষ্টি আকর্ষণ করতে চাই। আর সেটি আমরা করতে
                  চাচ্ছি মহানবী হযরত মুহাম্মাদ মুস্তফা সাল্লাল্লাহু আলাইহি
                  ওয়াসাল্লামের বেলাদাত দিবস উপলক্ষে প্রধান উপদেষ্টা ড. মুহাম্মদ
                  ইউনূসের দেওয়া একটি বাণীর সূত্র ধরে।
                </div>
                <br />
                <p className=" text-lg leading-relaxed ">
                  ১২ রবিউল আউয়াল এলেই প্রতি বছর রাষ্ট্রের ক্ষমতাসীনরা বড় বড় বাণী
                  প্রদান করে থাকেন। সেখানে সীরাতুন্নবী সাল্লাল্লাহু আলাইহি
                  ওয়াসাল্লামের বিভিন্ন দিক তুলে ধরা হয় এবং প্রিয় নবীর আদর্শ
                  অনুসরণের ওপর গুরুত্বারোপ করা হয়ে থাকে। পরিতাপের বিষয় হল, যারা
                  এমন বাণী দিয়ে থাকেন, কার্যক্ষেত্রে তাদের ব্যক্তিজীবন ও
                  কর্মজীবনে এর ছিটেফোঁটা নমুনাও দেখা যায় না। কিন্তু আমরা বর্তমান
                  সরকারের প্রধান ব্যক্তির বাণীকে সেভাবে নিতে চাই না। আমরা
                  বিশ্বাস করতে চাই, তিনি বুঝেশুনে এবং বিশ্বাস করেই এ বাণী
                  দিয়েছেন।
                </p>
                <br />

                <div className="text-lg leading-relaxed text-justify">
                  বিশ্বের অন্যান্য নেতা ও তাঁর মধ্যে পার্থক্য কী? পৃথিবীর দলীয়
                  প্রধান ও নেতারা দূর থেকে নেতৃত্ব দেন, সরাসরি যুদ্ধে নামেন না;
                  কিন্তু ইয়াহইয়া সিনওয়ারকে আমরা দেখি, তিনি শুধু সামনে থেকে
                  নেতৃত্ব দেননি; বরং সাধারণ সৈনিকের মতো শেষ মুহূর্ত পর্যন্ত লড়ে
                  গেছেন। অঙ্গহানী ও আহত হওয়া সত্ত্বেও যে বীরত্ব দেখিয়ে গেছেন- তা
                  ইতিহাসের পাতায় স্বর্ণাক্ষরে লেখা থাকবে। এ বীরত্ব যুগে যুগে
                  দেশে দেশে মাজলুমদের টিকে থাকার অনুপ্রেরণা দেবে। নিষ্পেষিত
                  মানুষকে প্রতিরোধ গড়ে তোলার সাহস জোগাবে।
                  <br />
                  <br />
                  <p className="text-lg leading-relaxed text-justify">
                    ড. মুহাম্মদ ইউনূস তার বাণীতে বলেছেনÑ ‘মহানবী হজরত মুহাম্মদ
                    (সা.) মানব জীবনের প্রতিটি ক্ষেত্রে; প্রতিটি ভূমিকায় অবতীর্ণ
                    হয়ে তিনি বিশ্ব মানবতার জন্য অনিন্দ্য সুন্দর অনুসরণীয় শিক্ষা
                    ও আদর্শ রেখে গেছেন; যা প্রতিটি যুগ ও শতাব্দীর মানুষের জন্য
                    মুক্তির দিশারি হিসেবে পথ দেখাবে।
                  </p>
                  <br />
                  <p className="text-lg leading-relaxed text-justify">
                    মহান আল্লাহ রাব্বুল আলামিন হজরত মুহাম্মদ (সা.)-কে বিশ্বজগতের
                    হেদায়েত ও নাজাতের জন্য ‘রাহমাতুল্লিল আলামিন’ তথা সারা
                    জাহানের রহমত হিসেবে প্রেরণ করেছেন। নবী করিম (সা.) সম্পর্কে
                    পবিত্র কোরআনে মহান আল্লাহ বলেছেনÑ ‘হে নবী, আমি আপনাকে সমগ্র
                    বিশ্বজগতের জন্য কেবল রহমতরূপে প্রেরণ করেছি’ (সূরা
                    আল-আম্বিয়া, আয়াত
                    <br />
                    <br />
                    : ১০৭)। মুহাম্মদ (সা.) এসেছিলেন তওহিদের মহান বাণী নিয়ে। সব
                    ধরনের কুসংস্কার, অন্যায়, অবিচার, পাপাচার ও দাসত্বের শৃঙ্খল
                    ভেঙে মানবসত্তার চিরমুক্তি, শান্তি, প্রগতি ও সামগ্রিক
                    কল্যাণের বার্তা নিয়ে এসেছিলেন তিনি। বিশ্ববাসীকে তিনি মুক্তি
                    ও শান্তির পথে আসার আহ্বান জানিয়ে অন্ধকার যুগের অবসান
                    ঘটিয়েছিলেন এবং সত্যের আলো জ্বালিয়েছেন। আজকের
                    দ্বন্দ্ব-সংঘাতময় বিশ্বে মহানবীর (সা.) অনুপম জীবনাদর্শ,
                    <br />
                    <br /> তাঁর সর্বজনীন শিক্ষা ও সুন্নাহর অনুসরণ এবং (আল্লাহর)
                    ইবাদতের মাধ্যমেই বিশ্বের শান্তি, ন্যায় এবং কল্যাণ নিশ্চিত
                    হতে পারে বলে আমি মনে করি। আমার দৃঢ় বিশ্বাস, ধর্মীয় ও পার্থিব
                    জীবনে মহানবী হজরত মুহাম্মদ (সা.) এর সুমহান আদর্শ ও সুন্নাহ
                    বিশ্ববাসীর জন্য সর্বকালের সর্বশ্রেষ্ঠ, উৎকৃষ্টতম অনুসরণীয় ও
                    অনুকরণীয় এবং এর মধ্যেই মুসলমানদের অফুরন্ত কল্যাণ, সফলতা ও
                    শান্তি নিহিত রয়েছে।’
                  </p>
                  <p className="text-lg py-4 leading-relaxed text-justify">
                    [দৈনিক ইত্তেফাক (অনলাইন সংস্করণ), ১৫ সেপ্টেম্বর ২০২৪]
                  </p>
                  <p className="text-lg py-4 leading-relaxed text-justify">
                    প্রধান উপদেষ্টা মহোদয়ের এ কথাগুলোর সূত্র ধরেই আমরা বলতে চাই,
                    বাংলাদেশ রাষ্ট্রের সংস্কার ও মেরামতের কাজটি এখান থেকেই শুরু
                    করা হোক। গণমানুষের অধিকার, শিক্ষা-দীক্ষার সর্বোচ্চ গুরুত্ব,
                    নারীমুক্তি ও শিশুঅধিকার, বিচারে স্বচ্ছতা ও ন্যায়পরায়ণতা,
                    সুষ্ঠু বিচারকার্য সম্পাদনে বিচারকের পূর্ণ স্বাধীনতার কথাগুলো
                    বলুন অথবা ধনী-দরিদ্রের সীমাহীন বৈষম্যের অবসান, সকল মানুষের
                    অন্ন-বস্ত্র ও বাসস্থানের সমাধান, ধর্ম-বর্ণ, অঞ্চল ও ভাষা
                    নির্বিশেষে সকল মানুষের জান-মাল, ইজ্জতের হেফাজতের গুরুত্ব
                    বলুনÑ এসবের কী নেই মানবতার মুক্তির দূত বিশ্বনবী হযরত
                    মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লামের পবিত্র সীরাত ও
                    তাঁর রেখে যাওয়া আদর্শে। আমাদের রাষ্ট্র গঠনে সেই যুগান্তকারী
                    শিক্ষা ও আদর্শগুলোর যতটুকুই আমরা গ্রহণ করব, নিঃসন্দেহে তা
                    আমাদেরকে সফলতার পথে এগিয়ে নেবে। আল্লাহ আমাদের তাওফীক দান
                    করুনÑ আমীন।
                  </p>
                  <br />
                  <br />
                  <p className="font-bold">মূর্তি ও পূজা ॥ </p>
                  <p className="my-4 text-[#E98121] font-bold text-lg">
                    যত ইচ্ছা মূর্তি বানানোর উৎসাহ প্রদান এবং মাদরাসা ছাত্রদের
                    পূজায় স্বেচ্ছাসেবক হওয়ার আগ্রহ প্রকাশ : কী হচ্ছে এসব?
                  </p>
                  <p>
                    হাসিনা সরকারের পতনের পর দেশের পরিস্থিতি ছিল বেশ অস্থিতিশীল।
                    সারা দেশের থানা ও পুলিশ প্রশাসন ছিল নিষ্ক্রিয়।
                    স্বার্থান্বেষী বিভিন্ন মহল কর্তৃক দেশে অরাজকতা ও
                    অস্থিতিশীলতা সৃষ্টির সমূহ আশঙ্কা ছিল। কিছু কিছু জায়গায় তারা
                    এসব করেছেও।
                    <br />
                    <br />
                    তখন দেশের কোনো কোনো স্থানে সংখ্যালঘুদের ধর্মীয় উপাসনালয়
                    বিশেষত হিন্দুদের মন্দির মুসলমানরা পাহারা দিয়েছে। যেন কেউ
                    কোনো অরাজক পরিস্থিতি সৃষ্টি করতে না পারে। পাহারাদাতাদের
                    মধ্যে কিছু মাদরাসা ছাত্রের কথাও গণমাধ্যমের খবরে প্রকাশ
                    পেয়েছে। সেটি ছিল একটি ক্রান্তিকালীন সময়। ভেতরের বিতর্কে না
                    গিয়েও এ বিষয়টিকে তখন কেউ দোষ হিসেবে ধরেননি; বরং দেশ-বিদেশে
                    এটা প্রশংসিত হয়েছে। বিশেষত যখন পাশর্^বর্তী হিন্দুপ্রধান
                    রাষ্ট্রের সংখ্যালঘুরা প্রতিদিন কোনো না কোনোভাবে
                    নির্যাতিত-নিপীড়িত হচ্ছে, মুসলমানদের মসজিদগুলো ভেঙে ফেলা
                    হচ্ছে। অথচ এ দেশে এর উল্টো চিত্র দেখা গেছে। এদেশের মানুষ যে
                    ধর্ম-বর্ণ নির্বিশেষে শান্তিপূর্ণ সহাবস্থান করেÑ আবারো তার
                    বহিঃপ্রকাশ ঘটেছে এর মাধ্যমে।
                    <br />
                    <br />
                    কিন্তু সেই যে শুরুÑ বিষয়টি যেন আর থামছে না। এখন তো বরং কোনো
                    কোনো ধর্মীয় রাজনৈতিক নেতা ও বিভিন্ন সংস্থার নেতারা হিন্দুদের
                    রক্ষাপূর্বক তাদের মূর্তি বানানোর জন্য উৎসাহ দিয়ে যাচ্ছেন।
                    পত্রিকার খবরগুলোতে যা এসেছে, তা তো বিশ্বাসযোগ্যই মনে হয় না।
                    এটাও নাকি বলা হচ্ছে, আপনারা যত ইচ্ছা মূর্তি বানান, আমরা
                    পাহারা দেব! ভাবটা এমন, যেন মূর্তি বানানো মুস্তাহাব-নফল বা
                    অতীব উত্তম কোনো কাজ। অথচ এ ধরনের নেতারাই একসময় মূর্তির
                    বিরোধিতা করে জেল-জুলুমের শিকার হয়েছেন। ওই মূর্তিগুলোকে তো
                    সেগুলোর নির্মাতারা ভাস্কর্য বলত। তারা এ অজুহাতও দিত যে,
                    ‘এগুলো তো আমরা উপাসনা বা ইবাদতের জন্য বানাই না; তাদের সম্মান
                    প্রদর্শনের জন্য বানাই।’ সেগুলো ছিল তাদের নেতাদের মূর্তি।
                    যদিও ইসলামে সব মূর্তিই মূর্তি এবং সব মূর্তিই হারাম। কিন্তু
                    শুধু পূজা-উপাসনার জন্য যে মূর্তি তৈরি করা হয়, আজ তা বানানোর
                    জন্যও উৎসাহ দেওয়া হচ্ছে! এ যেন শিরকের একেবারে নির্জলা
                    পক্ষপাতিত্ব। অথচ শিরক সবচেয়ে বড় পাপ, যাকে কুরআন কারীমে
                    সবচেয়ে বড় জুলুম বলা হয়েছে। সকল প্রকার ভেজালের গোড়া হল শিরক;
                    সৃষ্টিকর্তা আল্লাহ তাআলার সাথে অন্য কাউকে শরীক করা, অন্য
                    কারো উপাসনা করা, ইবাদতে অন্য কাউকে শরীক করা। আর সেই শিরকের
                    হাতিয়ারÑ মূর্তি বানানোর উৎসাহ দিচ্ছেন এক শ্রেণির আলেম!
                    হয়তোবা তারা রাজনৈতিক কৌশল হিসেবে এসব বলছেন। কিন্তু
                    কৌশলগতভাবেও এ ধরনের কথা বলার কি শরীয়তে সুযোগ আছে? এটা কি
                    বিশ্বাসযোগ্য হতে পারে? ভাবতেও তো কেমন লাগে! কিন্তু এটাকে এখন
                    ফ্যাশন বানানো হচ্ছে।
                    <br />
                    <br /> গণমাধ্যমও হয়তো বেশ খুশির সাথেই এর প্রচারণা দিচ্ছে। যত
                    বেশি প্রচারণা দিচ্ছে, তারা মনে করছে, এর মাধ্যমে তাদের
                    র‌্যাঙ্ক বাড়ছে! হয়তো কেউ কেউ ওই নেতাদের বোঝাচ্ছে যে, এর
                    দ্বারা আপনাদেরও র‌্যাঙ্ক বাড়বে। এজন্য তারা আরো স্পষ্ট ভাষায়
                    আরো কাঁচা শব্দে এগুলো বলছে। এই দুষ্টুচক্র থেকে অবশ্যই বের
                    হয়ে আসা উচিত। যারা এমনটি করছেন এবং বলছেন, তাদেরকে যেন বোঝানো
                    হয়Ñ এটা কিন্তু আগুনের সাথে খেলা হচ্ছে! তারা বলছে মাদরাসার
                    ছাত্র দিয়ে মন্দির পাহারা দেওয়ার কথা। এমনকি নিজেরাও পাহারা
                    দেবে বলছে! অথচ রাতদিন মাদরাসাগুলোতে শিরকের বিরুদ্ধে পড়াশোনা
                    হচ্ছে! মানুষকে ওয়াজ করা হচ্ছে! এমনকি যে মূর্তির পূজা করা হয়
                    না, সে মূর্তির বিরুদ্ধেও জান বাজি রাখা হয়েছে! এর বিরোধিতা
                    করে জেল-জুলুম পর্যন্ত খাটা হয়েছে। অথচ এখন শিরকের মূর্তি,
                    পূজার মূর্তিÑ এসব ক্ষেত্রে এসে বলা হচ্ছে, যার ইচ্ছা, যত
                    ইচ্ছা মূর্তি বানান! আরেকটা বিষয় দেখা যাচ্ছে, সরকারের একজন
                    উপদেষ্টা, তিনি যেখানে যাচ্ছেন, অনেক জায়গায় নাকি এসব
                    কথাবার্তা বলছেন! বিভিন্ন সংবাদ মাধ্যমে খবরগুলো আসছে। তিনি
                    প্রথম দিকে তো মন্দির পাহারা দেওয়ার বিষয়ে বলেছেন, মুসলমানরা
                    মন্দির পাহারা দিয়েছে, পাহারা দেবে। এখন আবার দৈনিক কালবেলার
                    এক খবরে দেখা গেল, তিনি বলেন, “মাদ্রাসার ছাত্ররা বলেছেন পূজা
                    কমিটি যদি চায় তারা স্বেছাসেবক হিসেবে কাজ করতে সম্মত আছেন।” ঐ
                    সভায় আরো বিভিন্ন কথা বলেছেন। আগের সরকার পূজায় কী কী সুবিধা
                    দিত, কত অনুদান দিত, মন্দিরগুলোতে তাঁরা আগের চেয়ে অনুদান কী
                    পরিমাণ বৃদ্ধি করছেনÑ এসব কথা। তো তিনি সে সব দিতে থাকুন, এটা
                    তার নিজস্ব ব্যাপার। কিন্তু এই উপদেষ্টা মহোদয়কে মাদরাসার
                    ছাত্রদের পূজার স্বেচ্ছসেবক বানাবার দায়িত্ব দিল কে? তাকে কি
                    দেশের মাদরাসাগুলোর দায়িত্বশীলগণ একথা বলে এসেছেন? যারা
                    নিজেদের সন্তানকে মাদরাসায় পড়তে দিয়েছেন, তারা কি তাকে এ
                    অনুমতি দিয়েছেন?
                    <br />
                    <br /> তারা তো এক আল্লাহ্য় বিশ্বাস করেন বলেই তাদের সন্তানদের
                    মাদরাসায় দিয়েছেন। তারা শিরকের বিপক্ষে অবস্থান নিয়েছেন এবং
                    শিরক বিশ্বাস করেন না বিধায়ই মুসলমান হয়েছেন; তারা নিজেদের
                    সন্তানকে ইসলামী শিক্ষায় শিক্ষিত করার জন্য মাদরাসায় দিয়েছেন।
                    যে মাদরাসায় রাতদিন এই মূর্তিপূজা ও শিরকের ক্ষতিগুলো পড়ানো
                    হয়, সে মাদরাসার ছাত্ররা নাকি এখন ঐ মহা শিরক অনুষ্ঠানের
                    স্বেচ্ছাসেবক হবে! নিজ পদের কৌশল হিসেবে হয়তো তিনি এসব বলছেন।
                    এভাবে কি নিজেদের নীতি-আদর্শ থেকে বিচ্যুত হওয়ার আশঙ্কা তৈরি
                    হচ্ছে না। তাঁর কি মনে পড়ে না আগের কালের মুরব্বি আলেমরা পূজা
                    দেখতে যাওয়া মুসলিমদের ঈমান ও বিবাহ পর্যন্ত (সতর্কতামূলক)
                    নবায়ন করে দিতেন। যাহোক, তাঁদের কিছু কিছু জিনিস তো মানুষ
                    সহনীয়ভাবে নিচ্ছে; কিন্তু মন্দির পাহারা ও পূজার স্বেচ্ছাসেবক
                    হওয়া! এ যেন বিগত ক্ষমতাচ্যুত প্রধানমন্ত্রীর কথাÑ ‘ধর্ম যার
                    যার উৎসব সবার’Ñ তারই প্রতিধ্বনি! এসব বক্তব্যের অর্থ জাতি
                    বুঝতে পারছে না। দেশের দ্বীনদার শ্রেণি, আলেম-উলামা খুব অবাক
                    হয়ে এসব কথা শুনছেন। এ ধরনের খবর পড়ছেন। এগুলো দেখে তাদের
                    দুঃখ-কষ্ট শুধু বাড়ছেই! আমাদের মনে হয়, যারা এখনো ‘মন্দির
                    মন্দির’ করছেন, মূর্তি মূর্তি জিগির তুলছেন, তাদের এগুলো বাদ
                    দিয়ে নিজেদের জরুরি কাজগুলো করা উচিত। সংখ্যালঘুরা আপনাদের
                    দায়িত্ব দেয়নি। তাদের ঠ্যাকা পড়েনি যে, মাদরাসাওয়ালাদের ডেকে
                    বলবে, আপনারা আমাদের মন্দির পাহারা দিন, আমাদের পূজার
                    স্বেচ্ছাসেবক হোন। যুগ যুগ ধরে এ দেশে মন্দির চলছে,
                    <br />
                    <br />
                    পূজা হয়েছে, কোথাও কখনো মাদরাসাওয়ালাদের কোনো পূজায় কাজ করতে
                    হয়নি। যুগ যুগ ধরে সনাতন ধর্মাবলম্বীরা মূর্তি বানিয়ে আসছে।
                    কোনো আলেমের বলতে হয়নি, আপনারা যত ইচ্ছা মূর্তি বানান! এখানে
                    আরেকটি কথা স্পষ্ট হওয়া দরকার। তা হচ্ছে, ইসলামে সংখ্যালঘুর
                    অধিকার। দ্বীনী বিষয়ে পড়াশোনা আছে এমন সকলেই অবগত যে, ইসলাম
                    ভিনধর্মী সংখ্যালঘুদের জান, মাল ও ইজ্জতের নিরাপত্তাসহ যাবতীয়
                    মানবিক অধিকার প্রদান করেছে। এমনকি নিজেদের গণ্ডিতে থেকে
                    ধর্ম-কর্ম পালনেরও অনুমতি দিয়েছে। অন্যদের মতো তাদের ঘরবাড়ির
                    নিরাপত্তা যেমন রাষ্ট্রের দায়িত্ব, তেমনি তাদের উপাসনালয়গুলো
                    নিরাপত্তা ঝুঁকিতে পড়লে তার বিহিত করাও সরকারের কর্তব্য।
                    আইন-শৃঙ্খলা রক্ষাকারী বাহিনীর মাধ্যমে সরকার তা সম্পাদন করবে।
                    সাধারণ মুসলিম জনগণ অথবা আলেম-উলামা ও দ্বীনদার শ্রেণি সে কাজ
                    করবেÑ এমন কথা না ইসলামে আছে, না রাষ্ট্রীয় নিয়মে আছে। সুতরাং
                    দুটি বিষয়কে গুলিয়ে ফেলা খুবই দুঃখজনক ও ...।
                  </p>
                  <br />
                  <br />
                  <p className="font-bold">ষড়যন্ত্র ॥ </p>
                  <br />
                  <p className="text-[#E67C0A] pb-3 text-lg font-bold">
                    ‘মেয়েরা রাত দখল করো’ কর্মসূচিতে অদ্ভুত সব দাবি : এদের পেছনে
                    কারা?
                  </p>
                  <p className="text-lg leading-relaxed">
                    তাঁর একটি কথা পড়ে নিজেকে ধরে রাখাই কঠিন হয়ে গিয়েছিল। এক
                    বক্তব্যে বীর মুজাহিদ ইয়াহইয়া সিনওয়ার দৃপ্ত কণ্ঠে বলছেন, 'আমি
                    আল্লাহর শুকরিয়া আদায় করছি, আল্লাহ আমাকে এত বছর বাঁচিয়ে
                    রেখেছেন। আমার এখন ৫৯ বছর। এতদিনে আমি মারাও যেতে পারতাম। এত
                    বছর অনেকে বাঁচেও না; কিন্তু আল্লাহ আমাকে এত বছর বাঁচিয়েছেন।
                    হয়তো শত্রু আমাকে শহীদ করে দেবে। আমাকে মেরে বাহাদুরি দেখাবে;
                    কিন্তু আমি বিছানায় মরে যাওয়ার চেয়ে আমাকে শত্রু মেরে ফেললে
                    শাহাদাতের মর্যাদা নিয়ে দুনিয়া থেকে যাব।'
                  </p>
                  <div className="text-lg leading-relaxed text-justify">
                    তাঁর একটি কথা পড়ে নিজেকে ধরে রাখাই কঠিন হয়ে গিয়েছিল। এক
                    বক্তব্যে বীর মুজাহিদ ইয়াহইয়া সিনওয়ার দৃপ্ত কণ্ঠে বলছেন, 'আমি
                    আল্লাহর শুকরিয়া আদায় করছি, আল্লাহ আমাকে এত বছর বাঁচিয়ে
                    রেখেছেন। আমার এখন ৫৯ বছর। এতদিনে আমি মারাও যেতে পারতাম। এত
                    বছর অনেকে বাঁচেও না; কিন্তু আল্লাহ আমাকে এত বছর বাঁচিয়েছেন।
                    হয়তো শত্রু আমাকে শহীদ করে দেবে। আমাকে মেরে বাহাদুরি দেখাবে;
                    কিন্তু আমি বিছানায় মরে যাওয়ার চেয়ে আমাকে শত্রু মেরে ফেললে
                    শাহাদাতের মর্যাদা নিয়ে দুনিয়া থেকে যাব।'{" "}
                  </div>
                  <br />
                  <div className="text-lg leading-relaxed text-justify">
                    এই যে ঈমান, প্রত্যয়, ত্যাগ- তিনি শুধু মুখেই বলেননি, করেও
                    দেখিয়েছেন। তিনি তার শেষ রক্তবিন্দু পর্যন্ত ইসলাম ও দেশের
                    জন্য লড়ে গেছেন। তিনি যেভাবে চেয়েছিলেন, সেভাবেই শাহাদাত বরণ
                    করেছেন। আমরা আগেও বলেছি, শেখ ইয়াসীন রাহ., ইসমাঈল হানিয়া রাহ.
                    এবং সর্বশেষ ইয়াহইয়া সিনওয়ার রাহ.-এর মতো যোদ্ধারা, সাহসী
                    মুজাহিদরা আত্মত্যাগ দিয়ে, লড়াই করে দেখিয়ে গেছেন তাদের জাতি
                    কেমন। শত্রু যত বড়ই হোক, যত শক্তিশালীই হোক, জান বাজি রেখে
                    প্রতিরোধ গড়ে তোলা হলে একসময় না একসময় শত্রু পিছপা হতে বাধ্য
                    হবেই। সে চাপে থাকবেই।
                  </div>
                  <br />
                  <div className="text-lg leading-relaxed text-justify">
                    এত ধ্বংসযজ্ঞের পরেও ইসরাইলের দুর্দশা এখনো কাটেনি। নিরপেক্ষ
                    অনেক বিশ্লেষকই বলছেন, তাদের অবস্থা দিন দিন খারাপ হচ্ছে।
                    ফিলিস্তিনের মুজাহিদরা বিশ্বের মজলুমদের জন্য আত্মত্যাগের নজির
                    রেখে যাচ্ছে। মুসলিম বিশ্বের উচিত তাদের প্রতি সহমর্মী হওয়া,
                    সম্ভাব্য সব সহযোগিতা অব্যাহত রাখা এবং দুআ জারি রাখা। মুসলিম
                    শাসকদের যেন শুভবুদ্ধির উদয় হয় সেজন্য দুআ ও চেষ্টা চালিয়ে
                    যাওয়া।
                  </div>
                </div>

                <br />

                <p className="text-lg leading-relaxed text-justify">
                  ৭ অক্টোবর ২০২৩ সালে 'তূফানুল আকসা' সংঘটিত হওয়ার পর থেকে
                  ফিলিস্তিন, লেবাননসহ মধ্যপ্রাচ্যে ইসরাইল যে ধ্বংসযজ্ঞ চালিয়ে
                  যাচ্ছে, বিশেষত ফিলিস্তিনের গাজায় নিত্যদিন যে হত্যাকাণ্ড চালিয়ে
                  যাচ্ছে, এর নজির পৃথিবীর ইতিহাসে হয়তো দ্বিতীয়টি পাওয়া যাবে না।
                  বর্তমান সময়ে পৃথিবী সভ্যতার দাবি করছে, মানবাধিকারের কথা বলছে,
                  গঠিত হয়েছে জাতিসংঘ, ইউরোপীয় ইউনিয়ন, ন্যাটো আরো কত কী? কত
                  আঞ্চলিক সংস্থা। মুসলমানদের ওআইসির কথা না হয় বাদই দিলাম। এ
                  সভ্যতার দাবির ভেতরেই নিরপরাধ মানুষদেরকে নিত্যদিন হত্যা করা
                  হচ্ছে। এই কথা যখন বলা হচ্ছে তখন ঘোষিত সংখ্যা অনুযায়ী শুধু গাজা
                  এলাকায়ই নিহতের সংখ্যা ৪২ হাজারেরও বেশি। আহত হয়েছে লক্ষাধিক
                  লোক। সবাই জানেন, এই নিহত ও আহত ব্যক্তিদের অল্প কিছু ছাড়া বেশির
                  ভাগই নারী, শিশু ও নিরপরাধ বেসামরিক লোকজন। গাজাকে যে তারা
                  ধ্বংসস্তূপে পরিণত করেছে, একটি জাতি নিধনে যে তারা লেগে আছে
                  দীর্ঘদিন ধরে, এর পরিপ্রেক্ষিতে আন্তর্জাতিক আদালত এটাকে গণহত্যা
                  বলে রায় দিয়েছেন- সেই রায় অবজ্ঞা করে যাচ্ছে ইসরাইল, আমেরিকা ও
                  পশ্চিমা শক্তি। এই অপরাধে ইসরাইলের মতো তার মিত্ররাও সমান
                  অপরাধী। ইসরাইল সেখানের ভাড়াটে খুনি হিসেবে খাটছে। ইসরাইলকে
                  টাকা-পয়সা, অস্ত্র-সস্ত্র সবকিছু সরবরাহ করছে মার্কিন
                  যুক্তরাষ্ট্র ও তার মিত্ররা।
                </p>
                <br />
                <p className="text-lg leading-relaxed text-justify">
                  পৃথিবী তো আর সবসময় একরকম চলবে না। পৃথিবীতে যত নারকীয়
                  হত্যাকাণ্ড যুগে যুগে জালেমরা ঘটিয়েছে, তাদের পরিণতি ভয়াবহ
                  হয়েছে। ইসরাইলের পরিণতি যে ভয়াবহ হবে- এটা এখন থেকেই অনেকে
                  ভবিষ্যদ্বাণী করছেন। যারা ইসরাইলকে সমর্থন দিয়ে যাচ্ছে, তাদেরও
                  বোঝা উচিত পৃথিবীর পরিস্থিতি কখন কোথা থেকে কোথায় গড়ায়, তার কোনো
                  ঠিক-ঠিকানা নেই
                </p>
                <br />
                <p className="text-lg leading-relaxed text-justify">
                  আমরা বিশেষত মুসলিম রাষ্ট্রগুলোর ভূমিকার কথা বলতে চাই, তারা আর
                  কতকাল নীরব ভূমিকায় থাকবে অথবা তলে তলে তারা আর কতকাল ইসরাইল
                  তোষণ করে যাবে। এ অঞ্চলে যুদ্ধ বিস্তৃত হওয়ার আশঙ্কা দিন দিন
                  বাড়ছে। যদি তাই হয়, তাহলে যারা ইসরাইলকে স্বীকৃতি দেওয়ার জন্য
                  বসে আছে, যাদের এমন দুঃসময়েও মাথাব্যথা নেই, তারা কিন্তু তখন
                  নিস্তার পাবে না। ইতিহাস তাদের ক্ষমা করবে না। তাদের হাশর হবে
                  দুঃসহ। এটা নিয়ে এখনই তাদের ভাবা উচিত।
                </p>
                <br />
                <p className="text-lg leading-relaxed text-justify">
                  সুতরাং সময় থাকতেই মুসলিম দেশগুলো বিশেষত আর্র্থিক ও সামরিকভাবে
                  শক্তিশালী দেশগুলোর শাসকদের উদ্যোগী হওয়া উচিত। যেসব অমুসলিম দেশ
                  ইসরাইলের পাশে নেই, ইসরাইলকে সমর্থন দিচ্ছে না, তাদেরকে সাথে
                  নিয়ে অগ্রসর হওয়া দরকার। বিগত দিনগুলোতে দেখা গেছে, বিশ্বের বড়
                  বড় কিছু অমুসলিম দেশ ইসরাইলের বিরুদ্ধে সোচ্চার হলেও মুসলিম
                  দেশগুলো কোনো ভূমিকা রাখেনি।
                </p>
                <br />
                <p className="text-lg leading-relaxed text-justify">
                  বীর মুজাহিদ শহীদ ইয়াহইয়া সিনওয়ারের স্মরণে মাসিক আলকাউসারের
                  চলতি সংখ্যায় সম্পাদকীয়সহ আরো দুটি লেখা প্রকাশিত হল। যা থেকে এ
                  জানবাজ আল্লাহর বান্দার গল্প ও বীরত্বগাথা আলকাউসারের পাঠকগণ
                  অবগত হতে পারবেন।{" "}
                </p>
              </p>
              <div className="flex flex-col md:flex-row mt-5 items-start md:items-center gap-4">
                <div className="text-xl mb-2 md:mb-0">প্রসঙ্গসমূহ:</div>
                <div className="flex flex-wrap gap-3">
                  <p className="px-3 py-1 text-white hover:bg-yellow-700 bg-yellow-600 inline-block text-center ">
                    দ্বীনিয়াত
                  </p>
                  <p className="px-3 py-1 text-white hover:bg-yellow-700 bg-yellow-600 inline-block text-center ">
                    অনৈতিকতা
                  </p>
                  <p className="px-3 py-1 text-white hover:bg-yellow-700 bg-yellow-600 inline-block text-center ">
                    মনীষী/স্মরণ
                  </p>
                  <p className="px-3 py-1 text-white hover:bg-yellow-700 bg-yellow-600 inline-block text-center ">
                    স্মৃতিচারণ/জীবন থেকে
                  </p>
                  <p className="px-3 py-1 text-white hover:bg-yellow-700 bg-yellow-600 inline-block text-center ">
                    নীতি-নৈতিকতা
                  </p>
                </div>
              </div>
              <div className="mt-16">
                <img src={adStart} alt="adStart" className="w-full" />
              </div>
            </div>

            <div className="mt-6 ">
              <div className="flex items-center right ">
                {headings.map((article, i) => (
                  <h2 className="text-2xl hover:text-green-600 text-gray-700 font-bold border-b border-yellow-500 flex-grow mb-2 pb-[10px]">
                    <Link key={i} to={article.path}>
                      {article.name}
                    </Link>
                  </h2>
                ))}

                <img src={mosque} alt="mosque" className="w-8 h-auto -ml-6" />
              </div>
              <div className="abc px-4 py-6">
                <div className="flex flex-wrap gap-3 mb-6 pb-5 border-b border-gray-200">
                  {tags.map((tag, index) => (
                    <Link
                      to={tag.path}
                      key={index}
                      className="px-3 py-1 text-gray-800 hover:bg-gray-500 hover:text-white  bg-gray-200  text-center"
                    >
                      {tag.name}
                    </Link>
                  ))}
                </div>
                <div className="text-center flex justify-start mt-4">
                  <Link to={"/buttons"}>
                    <button className="px-6 py-2 bg-green-600 text-white font-semibold  hover:bg-green-700">
                      আরো »
                    </button>
                  </Link>
                </div>
                <div className="mt-8">
                  <div className="flex items-center right ">
                    <h2 className="text-2xl  hover:text-green-600 text-gray-700 font-bold border-b border-yellow-500 flex-grow mb-2 pb-[10px]">
                      {current.map((article, i) => (
                        <Link key={i} to={article.path}>
                          {article.name}
                        </Link>
                      ))}
                    </h2>
                    <img
                      src={mosque}
                      alt="mosque"
                      className="w-8 h-auto -ml-6"
                    />
                  </div>
                  <div className="">
                    <div className="grid grid-cols-2  lg:grid-cols-3 gap-4 ">
                      {[
                        coverOne,
                        coverTwo,
                        coverThree,
                        coverFour,
                        coverFive,
                        coverSix,
                      ].map((cover, index) => (
                        <div key={index} className="relative group ">
                          {/* Image */}
                          <img
                            src={cover}
                            alt={`Cover ${index + 1}`}
                            className="w-full h-auto"
                          />

                          {/* Overlay */}
                          <div className="absolute inset-0 bg-white opacity-0 group-hover:opacity-30 transition-opacity duration-300"></div>
                        </div>
                      ))}
                    </div>
                  </div>
                </div>
              </div>
            </div>

            {/* right section */}
          </div>
        </div>
      </div>
    </div>
  );
};

export default Reform;
