import { useState } from "react";
import CustomBanner from "../components/shared/CustomBanner";

const ApnarZiggasa = () => {
  const [selectedYear, setSelectedYear] = useState("২০২৪"); // Set default year to ২০২৪
  const [selectedMonth, setSelectedMonth] = useState("জানুয়ারি"); // Set default month to জানুয়ারি

  const content = {
    "২০১৭": {
      নভেম্বর: {
        name: "মুহাম্মাদ মাহবুবুর রহমান - যশোর",
        question1: "৪২১৪. প্রশ্ন",
        question2: `
         আমাদের এলাকার মসজিদের ইমাম সাহেবের বাম হাতটি অচল। তাই তাকবীরে তাহরীমার সময় তিনি শুধু ডান হাত কান পর্যন্ত ওঠাতে পারেন। বাম হাত ওঠাতে পারেন না। তবে তাকবীরে তাহরীমার পর কিয়ামে স্বাভাবিকভাবেই দুই হাত নাভীর নীচে বাঁধতে পারেন।

কিছু কিছু লোক বলছে, অন্য সুস্থ ইমাম পাওয়া গেলে এই ইমামের পেছনে নামায সহীহ হবে না। সুস্থ ইমাম পাওয়া পর্যন্ত তিনি ইমামতি করতে পারবেন।

মুফতী সাহেবের কাছে বিনীত নিবেদন উক্ত ইমামের পেছনে নামায পড়ার হুকুম কী, তা জানিয়ে বাধিত করবেন। সুস্থ ইমাম পাওয়া যাওয়ার পর তার পেছনে নামায সহীহ হবে কি না? দলিল-প্রমাণসহ জানিয়ে উপকৃত করবেন।
        `,
        answer1: "উত্তর",
        answer2: `
          প্রশ্নোক্ত ইমামের পেছনে নামায পড়তে সমস্যা নেই। তার ইমামতি সহীহ আছে। ইমামতির যোগ্য ব্যক্তি তার পেছনে থাকলেও কোনো সমস্যা নেই।

উল্লেখ্য যে, ইমামতির দায়িত্ব অত্যন্ত গুরুত্বপূর্ণ। সুতরাং শারীরিক ত্রুটি আছে এমন ব্যক্তির তুলনায় পরিপূর্ণ সুস্থ ব্যক্তি স্থায়ী ইমাম হওয়া উত্তম। তবে যারা বলেছেন, সুস্থ ইমাম পাওয়া গেলে এই ইমামের পেছনে নামায সহীহ হবে না, তাদের কথা ঠিক নয়।

Ñআদ্দুররুল মুখতার ও রদ্দুল মুহতার ১/৫৬২
        `,
        author: "শেয়ার লিংক",
      },
    },
    "২০২৩": {
      অক্টোবর: {
        name: "আবদুল হামীদ - বারিধারা, ঢাকা",
        question1: "৬২৭১. প্রশ্ন",
        question2: `
         আমি এক মাদরাসার বাবুর্চি। রান্নার আগে বড় ডেকচিতে পানি নিই। তারপর সবজি কেটে ধোয়ার জন্য পানিতে ভিজিয়ে রাখি। যার ফলে পানিতে সবজির গন্ধ ভালোভাবেই অনুভূত হয়। মাঝে মাঝে নামাযের সময় কাছে পানি থাকে না। কিছুটা দূরে থাকে। অলসতাবশত পানি আনতে মন চায় না। ওযুর প্রয়োজনে আমি কি ঐ পানি দিয়ে ওযু করতে পারব?
        `,
        answer1: "উত্তর",
        answer2: `
          প্রশ্নোক্ত ক্ষেত্রে ঐ পানির স্বাভাবিক তরলতা যদি ঠিক থাকে, তাহলে ওযু সহীহ হয়ে যাবে। তবে পরিষ্কার-পরিচ্ছন্ন পানি দ্বারা যে ওযু করা ভালো, তা বলার অপেক্ষা রাখে না।

-আলআজনাস, নাতিফী ১/৪৬; আলমুলতাকাত ফিল ফাতাওয়া, পৃ. ৯; ফাতাওয়া হিন্দিয়া ১/২১
        `,
        author: "শেয়ার লিংক",
      },
      নভেম্বর: {
        name: "তানভীর হাসান - ঢাকা",
        question1: "৬৩০১. প্রশ্ন",
        question2: `
         একদিন বাড়িতে যোহরের নামাযের সময় ওযু করে চামড়ার মোজা পরিধান করি। হঠাৎ ঐদিন রাতেই আমাকে ঢাকা থেকে চট্টগ্রামের উদ্দেশে রওয়ানা হতে হয়। এখন আমি কতদিন মোজার ওপর মাসেহ করতে পারব? মোজা পরিধানের সময় তো মুকীম ছিলাম, পরে সফরে বের হয়েছি।
        `,
        answer1: "উত্তর",
        answer2: `
          প্রশ্নোক্ত ক্ষেত্রে আপনি যেহেতু মুকীম অবস্থায় মোজা পরার পর মুকীমের জন্য মাসেহের নির্ধারিত সময়সীমা- এক দিন এক রাত পূর্ণ হওয়ার আগেই সফরে বের হয়েছেন, তাই এক্ষেত্রে আপনি মুসাফিরের জন্য মাসেহের সময়সীমা তিন দিন তিন রাত পূর্ণ করতে পারবেন। সুতরাং প্রশ্নোক্ত ক্ষেত্রে আপনি মোজা পরিধানের পর প্রথমবার ওযু ভাঙার সময় থেকে তিন দিন তিন রাত পর্যন্ত এর ওপর মাসেহ করতে পারবেন।

-কিতাবুল আছল ১/৭৬; শরহু মুখতাসারিত তাহাবী, জাস্সাস ১/৪৫৩; ফাতাওয়া ওয়ালওয়ালিজিয়া ১/৬২; ফাতহুল কাদীর ১/১৩৬; আদ্দুররুল মুখতার ১/২৭৮
        `,
        author: "শেয়ার লিংক",
      },
    },
    "২০২৪": {
      জানুয়ারি: {
        name: "উম্মে সালওয়া - মোমেনশাহী",
        question1: "৬৩৪০. প্রশ্ন",
        question2: `
         আমি কখনো কখনো বড় বালতিতে পানি নিয়ে সেখানে বাচ্চাদের নাপাক কাঁথা কাপড় একবার ভালোভাবে ধুয়েই তুলে ফেলি। এগুলো যেহেতু বাচ্চাদের কাপড়, তাই এগুলো পাক করার উদ্দেশ্যে তিনবার ধোয়া হয় না। এরপর এগুলো ভালোভাবে চিপে শুকানোর জন্য রশিতে ছড়িয়ে দিই। কাপড়ের আর্দ্রতায় রশিও হালকা ভিজে যায়। এরপর কখনো এই রশিতেই আমাদের পবিত্র ভেজা কাপড় ছড়িয়ে দেওয়া হয়।

জানার বিষয় হল, রশিতে নাপাক কাপড় শুকানোর পর পবিত্র কাপড় দেওয়ার দ্বারা কি পবিত্র কাপড়গুলো নাপাক হয়ে যাবে?
        `,
        answer1: "উত্তর",
        answer2: `
          প্রশ্নোক্ত ক্ষেত্রে নাপাক কাপড়গুলো পাক করে না ধুলেও যেহেতু সেগুলো ভালোভাবে চিপে রশিতে দেওয়া হয়, তাই এক্ষেত্রে ঐ রশি হালকা ভিজে গেলেও যদি তাতে নাপাকীর গন্ধ বা রং প্রকাশ না পায়, তবে ঐ রশি নাপাক গণ্য হবে না। সুতরাং এরপর তাতে পাক কাপড় শুকালে ঐ কাপড়ও নাপাক হবে না।

আর যদি তাতে নাপাক কাপড় দেওয়ার পর এর নাপাক পানিতে রশি এত বেশি ভিজে যায় যে, তা চিপলে এর থেকে পানি ঝরবে অথবা রশিতে নাপাকীর গন্ধ বা রং প্রকাশ পায় তাহলে এক্ষেত্রে উক্ত রশি নাপাক গণ্য হবে। অবশ্য এক্ষেত্রেও উক্ত রশি শুকিয়ে যাওয়ার পর তাতে পাক কাপড় ভালোভাবে চিপে শুকাতে দিলে উক্ত কাপড় নাপাক হবে না।

—ফাতাওয়া খানিয়া ১/৩১; তাবয়ীনুল হাকায়েক ৭/৪৪৯; শরহুল মুনইয়া, পৃ. ১৭৪; আদ্দুররুল মুখতার ৬/৭৩৩; রদ্দুল মুহতার ৬/৭৩৩
        `,
        author: "শেয়ার লিংক",
      },
      সেপ্টেম্বর: {
        name: "খালেদ - চান্দিনা, কুমিল্লা",
        question1: "৬৫৬৯. প্রশ্ন",
        question2: `
         গতকাল আমি ডায়াবেটিস মাপাতে গেলাম। ডায়াবেটিস মাপানোর সময় গ্লুকোমিটারের কলম দিয়ে আঙুল থেকে সামান্য রক্ত বের করা হয়, যা গড়িয়ে পড়া পরিমাণ ছিল না। সেটা মেশিনে লাগানোর পর এর তেমন কিছু আঙুলে অবশিষ্ট ছিল না। পরে কাটা অংশটা আমি বৃদ্ধাঙ্গুলী দিয়ে ঘষে মুছে ফেলি। এরপর ঐ অবস্থাতেই পুনরায় ওযু না করে এবং হাত না ধুয়ে এশার নামায আদায় করি।

হুজুরের কাছে জানতে চাই, এভাবে রক্ত বের হওয়ার পরও পুনরায় ওযু না করে এবং হাতও না ধুয়ে নামায আদায় করা কি ঠিক হয়েছে? জানিয়ে বাধিত করবেন।
        `,
        answer1: "উত্তর",
        answer2: `
          প্রশ্নোক্ত ক্ষেত্রে আঙুল থেকে বের হওয়া রক্ত যেহেতু এতই অল্প ছিল যে, তা নিজ স্থান থেকে গড়িয়ে পড়া পরিমাণ ছিল না, তাই এর কারণে ওযু নষ্ট হয়নি। অতএব এরপর পুনরায় ওযু না করে এবং হাতও না ধুয়ে আপনি যে নামায পড়েছেন তা আদায় হয়ে গেছে।

Ñকিতাবুল আছার, ইমাম আবু ইউসুফ, বর্ণনা ২৩; কিতাবুল আছল ১/৪৪; শরহুল জামিইস সাগীর, কাযীখান ১/৩০; আলমুহীতুল বুরহানী ১/১৯৫; আলবাহরুর রায়েক ১/৩৩; আদ্দুররুল মুখতার ১/১৪০
        `,
        author: "শেয়ার লিংক",
      },
      অক্টোবর: {
        name: "নাসিম খান - বাঘারপাড়া, যশোর",
        question1: "৬৫৪১. প্রশ্ন",
        question2: `
         হুজুর, এক্সিডেন্টে আমার বাম হাত ভেঙে যাওয়ায় ডাক্তার পুরো হাত ব্যান্ডেজ করে দিয়েছে। তাই আমি ট্যাপ ছেড়ে ডান হাতের সাহায্যে ওযুর অঙ্গগুলো ধৌত করি আর বাম হাতের ব্যান্ডেজের ওপর মাসেহ করি। আজ ভোরে ওযু করার সময় হাতের ব্যান্ডেজের ওপর মাসেহ করলেও বেখেয়ালে আঙ্গুলগুলোর অগ্রভাগের ব্যান্ডেজের অংশ মাসেহ করা হয়নি। এরপর ঐ ওযু দিয়েই ফজর নামায পড়েছি।

জানার বিষয় হল, আমার উক্ত নামায কি সহীহ হয়েছে?
        `,
        answer1: "উত্তর",
        answer2: `
          হাঁ, আপনার উক্ত নামায আদায় হয়েছে। কেননা ব্যান্ডেজের ওপর মাসেহের ক্ষেত্রে ব্যান্ডেজের পুরো অংশ মাসেহ করা জরুরি নয়; ব্যান্ডেজের অধিকাংশ স্থান মাসেহ করা হলেই ওযু সহীহ হয়ে যায়।

অতএব, আপনি যেহেতু ব্যান্ডেজের অল্প কিছু অংশ ছাড়া এর অধিকাংশ স্থানই মাসেহ করেছেন, তাই এক্ষেত্রে আপনার ওযু সহীহ হয়েছে এবং ঐ নামাযও সহীহ হয়েছে।

Ñআলমুহীতুর রাযাবী ১/১৮৮; খুলাসাতুল ফাতাওয়া ১/২৭; হালবাতুল মুজাল্লী ১/৩৪৯; আলবাহরুর রায়েক ১/১৮৭; আদ্দুররুল মুখতার ১/২৮২
        `,
        author: "শেয়ার লিংক",
      },
    },
  };
// data for custom component
  const bannerData = {
    title: "আপনি যা জানতে চেয়েছেন",
  };

  const selectedContent = content[selectedYear]?.[selectedMonth];

  return (
    <div className="font-bengali pt-24">
      <div>
        <CustomBanner bannerData={bannerData} />
      </div>
      <div className="container mx-auto p-6 mt-10">
        <div className="grid grid-cols-1 md:grid-cols-3">
          <div className="col-span-2">
            <div className="font-bengali pt-4">
              <div className="flex flex-wrap gap-4 mb-6">
                {/* Year Dropdown */}
                <div className="relative inline-block">
                  <select
                    className="text-center text-xl font-bengali border border-gray-300 rounded px-4 py-2"
                    value={selectedYear}
                    onChange={(e) => {
                      setSelectedYear(e.target.value);
                      setSelectedMonth(""); // Reset month selection when year changes
                    }}
                  >
                    <option value="">বছর নির্বাচন করুন</option>
                    <option value="২০২৪">২০২৪</option>
                    <option value="২০২৩">২০২৩</option>
                    <option value="২০১৭">২০১৭</option>
                    {/* Add more years as needed */}
                  </select>
                </div>

                {/* Month Dropdown */}
                <div className="relative inline-block">
                  <select
                    className="text-center text-xl font-bengali border border-gray-300 rounded px-4 py-2"
                    value={selectedMonth}
                    onChange={(e) => setSelectedMonth(e.target.value)}
                    disabled={!selectedYear} // Disable month dropdown until year is selected
                  >
                    <option value="">মাস নির্বাচন করুন</option>
                    <option value="জানুয়ারি">জানুয়ারি</option>

                    <option value="সেপ্টেম্বর">সেপ্টেম্বর</option>
                    <option value="অক্টোবর">অক্টোবর</option>
                    <option value="নভেম্বর">নভেম্বর</option>
                  </select>
                </div>
              </div>

              {/* Display the content based on selected year and month */}
              <div className="border-t pt-4">
                {selectedContent ? (
                  <div>
                    {/* Display Author and Question Number */}
                    <p className="text-xl font-semibold mb-4">
                      {selectedContent.name}
                    </p>
                    <p className="text-lg font-bold mb-2">
                      <strong>প্রশ্ন:</strong> ০১৩.
                    </p>

                    {/* Question Section */}
                    <div className="item-1 mb-6  text-justify">
                      <p className="text-lg text-left leading-relaxed">
                        {selectedContent.question2}
                      </p>
                    </div>

                    {/* Answer Section */}
                    <p className=" text-lg mb-2 font-semibold">উত্তর:</p>
                    <div className="item-2 mb-4 text-justify">
                      <p className="text-lg text-left leading-relaxed">
                        {selectedContent.answer2}
                      </p>
                    </div>
                    <div className="item-2 mb-4 text-justify">
                      <p className="text-sm text-left leading-relaxed">
                        {selectedContent.author}
                      </p>
                    </div>
                  </div>
                ) : (
                  <p className="text-xl whitespace-pre-wrap">
                    বছর এবং মাস নির্বাচন করুন
                  </p>
                )}
              </div>
            </div>
          </div>
          <div></div>
        </div>
      </div>
    </div>
  );
};

export default ApnarZiggasa;
